[
  {
    "witnessName": "Alexandra Persicov",
    "linkedin_link": "https://www.linkedin.com/in/alexandra-persicov-1309/",
    "witnessDesignation": "Senior Project Manager at BORN Group, INC a Tech Mahindra Company",
    "posted_on": "January 29, 2025",
    "testimonial": "I have had the distinct pleasure of collaborating with Sarthak on several projects, and I must say, he is a remarkable developer with an impressive eye for detail. His strengths are not just a checklist; they're more like a superhero's utility belt! Here are a few of his standout qualities:<br>- He asks insightful questions before diving into a task, ensuring he's on the right track from the get-go.<br>- His estimating skills are spot on, making project planning a breeze.<br>- Sarthak has a knack for staying within budget-he could probably teach a masterclass on financial wizardry!<br>- Even when the brief isn't fully fleshed out, he takes the initiative and runs with it, demonstrating his adaptability.<br>- He meticulously ensures that the designs align perfectly with the build, leaving no room for discrepancies.<br>- And let's not forget his ability to keep.<br>PR and QA issues to a minimum-he's like the quality control ninja we all aspire to be! In short, working with Sarthak is not just productive; it's also a lot of fun!"
  },
  {
    "witnessName": "Alexandra Persicov",
    "linkedin_link": "https://www.linkedin.com/in/alexandra-persicov-1309/",
    "witnessDesignation": "Senior Project Manager at BORN Group, INC a Tech Mahindra Company",
    "posted_on": "January 29, 2025",
    "testimonial": "I have had the distinct pleasure of collaborating with Sarthak on several projects, and I must say, he is a remarkable developer with an impressive eye for detail. His strengths are not just a checklist; they're more like a superhero's utility belt! Here are a few of his standout qualities: 1. He asks insightful questions before diving into a task, ensuring he's on the right track from the get-go. 2. His estimating skills are spot on, making project planning a breeze. 3. Sarthak has a knack for staying within budget-he could probably teach a masterclass on financial wizardry! 4. Even when the brief isn't fully fleshed out, he takes the initiative and runs with it, demonstrating his adaptability. 5. He meticulously ensures that the designs align perfectly with the build, leaving no room for discrepancies. 6. And let's not forget his ability to keep. PR and QA issues to a minimum-he's like the quality control ninja we all aspire to be! In short, working with Sarthak is not just productive; it's also a lot of fun!"
  }
]
