[
  {
    "witnessName": "Alexandra Persicov",
    "linkedin_link": "https://www.linkedin.com/in/alexandra-persicov-1309/",
    "witnessDesignation": "Senior Project Manager at BORN Group, INC a Tech Mahindra Company",
    "posted_on": "January 29, 2025",
    "testimonial": "I have had the distinct pleasure of collaborating with Sarthak on several projects, and I must say, he is a remarkable developer with an impressive eye for detail. His strengths are not just a checklist; they're more like a superhero's utility belt! Here are a few of his standout qualities:<br>• He asks insightful questions before diving into a task, ensuring he's on the right track from the get-go.<br>• His estimating skills are spot on, making project planning a breeze.<br>• Sarthak has a knack for staying within budget-he could probably teach a masterclass on financial wizardry!<br>• Even when the brief isn't fully fleshed out, he takes the initiative and runs with it, demonstrating his adaptability.<br>• He meticulously ensures that the designs align perfectly with the build, leaving no room for discrepancies.<br>• And let's not forget his ability to keep.<br>PR and QA issues to a minimum-he's like the quality control ninja we all aspire to be! In short, working with Sarthak is not just productive; it's also a lot of fun!"
  },
  {
    "witnessName": "Soumyajit Bag",
    "linkedin_link": "https://www.linkedin.com/in/soumyajitbag/",
    "witnessDesignation": "Associate Software Engineer at Tech Mahindra",
    "posted_on": "March 20, 2025",
    "testimonial": "Working with Sarthak has been an absolute game-changer. He's not just a skilled developer—he's the kind of teammate who elevates every project he touches. Here's why he stands out:<br>• Sarthak takes the time to deeply understand a task before jumping in, asking the right questions and clarifying expectations from the start.<br>• His timelines are impressively accurate—no guessing games, just solid planning.<br>• Budget-conscious and resourceful, he always finds smart ways to deliver high-quality results without unnecessary costs.<br>• He thrives in ambiguity, often stepping up when requirements are vague and transforming them into structured, actionable plans.<br>• His attention to design detail ensures that what's built is not just functional, but pixel-perfect.<br>• Plus, he consistently delivers clean work that minimizes back-and-forth during testing and reviews.<br>Simply put, Sarthak brings reliability, creativity, and a great energy to the table. Collaborating with him has been both seamless and inspiring."
  },
  {
    "witnessName": "Akgun Kaya",
    "linkedin_link": "https://www.linkedin.com/in/akgun-kaya-04685419b/",
    "witnessDesignation": "Senior Shopify Developer at BORN Group, INC a Tech Mahindra Company",
    "posted_on": "February 14, 2025",
    "testimonial": "Sarthak is an exceptional software engineer with outstanding frontend development skills. Their attention to detail, clean code, and problem-solving abilities make them an invaluable asset to any team. Highly recommend!"
  },
  {
    "witnessName": "Pratyush Mallick",
    "linkedin_link": "https://www.linkedin.com/in/pratyush-mallick-2b917922/",
    "witnessDesignation": "Senior Shopify Developer at BORN Group, INC a Tech Mahindra Company",
    "posted_on": "April 11, 2025",
    "testimonial": "Working with Sarthak has been a pleasure. He is proactive, reliable, and always eager to learn. His positive attitude and dedication makes him a valuable asset to any team."
  }
]
